Revit 2024 API
ParameterTypeId.FabricationServiceName Property
 "Fabrication Service Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationServiceName { get; }
Visual Basic
Public Shared ReadOnly Property FabricationServiceName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationServiceName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace